Parametric Heatsink Simulation/Linux Files/pitch_5mm_nfins_15/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
application     chtMultiRegionFoam;
startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         100;
deltaT          1e-6;
adjustTimeStep  yes;
maxCo           0.4;
maxDeltaT       0.01;
writeControl    adjustableRunTime;
writeInterval   10;
purgeWrite      3;
writeFormat     ascii;
writePrecision  8;
runTimeModifiable true;
functions {}
