Parametric Heatsink Simulation/Linux Files/pitch_5mm_nfins_15/constant/solid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/solid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    base_bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          7200;
        startFace       196040;
    }
    side_walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          320;
        startFace       203240;
    }
    solid_to_fluid
    {
        type            mappedWall;
        inGroups        1(wall);
        nFaces          32400;
        startFace       203560;
        sampleMode      nearestPatchFace;
        sampleRegion    fluid;
        samplePatch     fluid_to_solid;
    }
)

// ************************************************************************* //
