Parametric Heatsink Simulation/Linux Files/pitch_5mm_nfins_15/constant/fluid/turbulenceProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      turbulenceProperties;
}
simulationType  laminar;
