Parametric Heatsink Simulation/Linux Files/pitch_5mm_nfins_15/constant/fluid/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/fluid";
    object      thermophysicalProperties;
}
thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}
mixture
{
    specie          { molWeight 28.9; }
    thermodynamics  { Cp 1005; Hf 0; }
    transport       { mu 1.84e-5; Pr 0.713; }
}
dpdt            no;
