Parametric Heatsink Simulation/Linux Files/pitch_5mm_nfins_15/constant/regionProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      regionProperties;
}
regions
(
    fluid ( fluid )
    solid ( solid )
);
