Parametric Heatsink Simulation/Linux Files/pitch_5mm_nfins_15/0/fluid/U
FoamFile
{
    version 2.0; format ascii;
    class volVectorField; location "0/fluid"; object U;
}
dimensions [0 1 -1 0 0 0 0];
internalField uniform (0 0 -2.86);
boundaryField
{
    fan1_half0     { type fixedValue; value uniform (0 0 -2.86); }
    fan2_half0     { type zeroGradient; }
    base_bottom    { type noSlip; }
    top_wall       { type noSlip; }
    side_walls     { type noSlip; }
    fluid_to_solid { type noSlip; }
}
