Parametric Heatsink Simulation/Linux Files/pitch_5mm_nfins_15/0/fluid/p
FoamFile
{
    version 2.0; format ascii;
    class volScalarField; location "0/fluid"; object p;
}
dimensions [1 -1 -2 0 0 0 0];
internalField uniform 101325;
boundaryField
{
    fan1_half0     { type calculated; value uniform 101325; }
    fan2_half0     { type calculated; value uniform 101325; }
    base_bottom    { type calculated; value uniform 101325; }
    top_wall       { type calculated; value uniform 101325; }
    side_walls     { type calculated; value uniform 101325; }
    fluid_to_solid { type calculated; value uniform 101325; }
}
