Parametric Heatsink Simulation/Linux Files/pitch_5mm_nfins_15/0/fluid/p_rgh
FoamFile
{
    version 2.0; format ascii;
    class volScalarField; location "0/fluid"; object p_rgh;
}
dimensions [1 -1 -2 0 0 0 0];
internalField uniform 0;
boundaryField
{
    fan1_half0     { type fixedFluxPressure; value uniform 0; }
    fan2_half0     { type fixedValue; value uniform 0; }
    base_bottom    { type fixedFluxPressure; value uniform 0; }
    top_wall       { type fixedFluxPressure; value uniform 0; }
    side_walls     { type fixedFluxPressure; value uniform 0; }
    fluid_to_solid { type fixedFluxPressure; value uniform 0; }
}
