Parametric Heatsink Simulation/Linux Files/pitch_5mm_nfins_15/0/solid/p
FoamFile
{
    version 2.0; format ascii;
    class volScalarField; location "0/solid"; object p;
}
dimensions [1 -1 -2 0 0 0 0];
internalField uniform 101325;
boundaryField
{
    base_bottom    { type calculated; value uniform 101325; }
    side_walls     { type calculated; value uniform 101325; }
    solid_to_fluid { type calculated; value uniform 101325; }
}
