Parametric Heatsink Simulation/Linux Files/pitch_5mm_nfins_15/system/fluid/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/fluid";
    object      fvSchemes;
}
ddtSchemes      { default Euler; }
gradSchemes
{
    default         Gauss linear;
    grad(U)         cellLimited Gauss linear 1;
}
divSchemes
{
    default                             none;
    div(phi,U)                          Gauss linearUpwind grad(U);
    div(phi,h)                          Gauss linearUpwind default;
    div(phi,K)                          Gauss linearUpwind default;
    div(phi,Ekp)                        Gauss linearUpwind default;
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}
laplacianSchemes { default Gauss linear corrected; }
interpolationSchemes { default linear; }
snGradSchemes   { default corrected; }
fluxRequired    { default no; p_rgh; }
