Parametric Heatsink Simulation/Linux Files/pitch_5mm_nfins_15/system/solid/fvSolution
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/solid";
    object      fvSolution;
}
solvers
{
    h
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0.1;
    }
    hFinal
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-7;
        relTol          0;
    }
}
PIMPLE
{
    nNonOrthogonalCorrectors 0;
}
relaxationFactors
{
    equations { h 0.9; }
}
